#include <iostream>
#include <iomanip>
using namespace std;

int main()
{
    int month,year;
    string monthsList[12] = {"Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"};
    int mDays [12] = {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
    
    month = 12;
    while (month < 1 || month > 12)
    {
    cout<<"Неверно введён месяц. Введите номер месяца от 1 до 12, где \n 1 - январь \n 12 - декабрь";
    cin>>month;
    }
    cout<<"Введите номер года от 1900 до 2035: ";
    cin>>year;
    
    while (year < 1900 || year > 2035)
    {
    cout<<"Неверно введён год. Введите число от 1900 до 2035:\n";
    cin>>year;
    }
    
    cout<<" —------------------------------"<<endl;
    cout<<" Calendar - "<<year<<endl;
    cout<<" —------------------------------"<<endl;
    
    /*
    1) Определим номер дня недели, где:
    
    0 - Понедельник
    1 - Вторник
    2 - Среда
    3 - Четверг
    4 - Пятница
    5 - Суббота
    6 - Воскресенье
    
    */
    for (int g = 1; g <= month; g++)
    {
        int days;
        int current;
        static int t[] = {0, 3, 2, 5, 0, 3, 5, 1, 4, 6, 2, 4};
        int y = year - 1;
        current = (y + y/4 - y/100 + y/400 + t[g - 1] + 1) % 7; // от 0 до 6
        
        /*
        2) Проверка на високосность начиная с нулевого месяца:
        0 - январь
        ...
        11 - декабрь
        */
        if (int i = g - 1)
        {
            if( i==1 ) // 1 - это февраль месяц, так как счёт начинается с 0.
                if (year % 400 == 0 || (year % 4 == 0 && year % 100 != 0))
                    days = 29; // Если високосный
                else
                    days = mDays[i];
            else
                days = mDays[i];
        
        /*
        3) Выводим сам календарь
        */
        cout<<endl<<" —----------"<<monthsList[i]<<"-------------"<<endl;
        
        cout<<" Пн  Вт  Ср  Чт  Пт  Сб  Вс"<<endl;
        
        /*
        4) Вводим доп. переменные k и j:
        k - количество дней в неделе от 0 до 6 (0 - ПН; 6 - ВС)
        j - количество дней в месяце (от 1 до общего в месяце)
        */
        int k;
        
        for (k = 0; k < current; k++)
        cout<<" ";
        
        for (int j = 1; j <= days; j++)
        {
            k++;
            cout<<setw(4)<<j;
            if (k > 6)
        {
        k = 0;
        cout<<endl;
        }
        }
        
        if (k)
        cout<<endl;
        
        current = k;
        }
        
    }
}
