/******************************************************************************
* Степанов Артём Андреевич,ПИ-231
* Share-Link:https://onlinegdb.com/6pWn_QjpyL
* Тема: Обработка массивов, вариант 20  
*******************************************************************************/

#include <iostream>

using namespace std;

int main()
{
    int C[2][2], a1, a2, b1, b2;
    cout << "Введите число для С (1,1)" << endl;
    cin >> C[0][0];
    cout << "Введите число для С (1,2)" << endl;
    cin >> C[0][1];
    cout << "Введите число для С (2,1)" << endl;
    cin >> C[1][0];
    cout << "Введите число для С (2,2)" << endl;
    cin >> C[1][1];
    
    if (C[0][0]>C[1][1]) { 
        a1 = C[0][0];
        b1 = C[1][1];
    }
    else {
        a1 = C[1][1];
        b1 = C[0][0];
    }
    
    if (C[0][1]>C[1][0]) { 
        a2 = C[0][1];
        b2 = C[1][0];
    }
    else {
        a2 = C[1][0];
        b2 = C[0][1];
    }
    
    for (int j = 0; j < 2; j++) {
        for (int i = 0; i < 2; i++) { 
           cout << C[j][i] << " ";
        }
        cout << endl;
    }
    cout << "Большее число главной диагонали: " << a1 << endl;
    cout << "Меньшее число главной диагонали: " << b1 << endl;
    cout << "Большее число побочной диагонали: " << a2 << endl;
    cout << "Меньшее число побочной диагонали: " << b2 << endl;
}
